package com.automatedworkspace.inventorymanagement.ui;

import javax.swing.*;

/**
 *Потрібно зробити 4 панелі, 1 Додати Постачальника, 2 Створити товар, 3 Додати Товар до існуючого, 4 вибір між ними
 * у Постачальнику поле для написання тексту, і якийсь Label для виведення інформації додався чи вже існує
 * У створенні товару
 * список постачальників
 * (текстові поля)
 * ID, Назва, Ціна за од. , Нижня межа поповнення
 * У додаванні товару
 * список (товарів), що випадає
 * (текстові поля)
 * Кількість для поповнення
 * Інтервал поповнення
 *
 *
 * Додати лейбли щоб було зрозуміло, що робить кожне поле
 * назви полів поміняй на чітко описують слова поле, не скорочувати
 *
 * Розміри панелей 1280x720
 */
public class AddItemForm {
    private JPanel panel1;
}
